      * run cobc -x hello-world.cbl to compile.
      * run ./hello-world to run the compile program.
				Identification Division.
		    Program-ID. sampleCOBOL.

		    Procedure Division.
		    Main-Paragraph.
						Display "Hello World!"
		        Stop Run.
