      * run cobc -x test.cbl to compile.
      * run ./test to run the compile program.
				Identification Division.
		    Program-ID. sampleCOBOL.

		    Data Division.

		    Procedure Division.
		    Main-Paragraph.
		        Display "Hello World!"
		        Stop Run.
